#!/usr/bin/python
# encoding: utf-8

import sys
#ebook-convert 杜甫.recipe  杜甫.mobi
a='''李世民 杜甫 柳宗元 劉禹錫 王維 孟浩然 李白 白居易 杜牧 高適 元稹 李賀 韓愈 王昌齡 韋應物 岑參 賈島 溫庭筠 李商隱 劉長卿 許渾 韋莊 陸龜蒙 皮日休 張九齡 宋之問 王勃 駱賓王 張說 陳子昂 綦毋潛 王建'''
L2= [x.strip() for x in a.split()]

#L1=[]
#with open('juan.txt') as f:
#    L3= f.readlines()
#    for x in L3:
#        if '卷' not in x:
#            continue
#        author = x.strip().split()[1]
#        if author not in L1:
#            L1.append(author)
L1=['李世民', '李治', '李隆基', '李亨', '武則天', '李賢', '鮑君徽', '南唐諸人', '徐氏', '郊廟歌辭', '樂府雜曲', '橫吹曲辭', '相和歌辭', '舞曲歌辭', '琴曲歌辭', '雜曲歌辭', '雜歌謠辭', '王珪', '魏征', '褚亮', '劉孝孫', '楊師道', '許敬宗', '虞世南', '王績', '鄭世翼', '陳子良', '上官儀', '盧照鄰', '李百藥', '劉禕之', '陳元光', '韋承慶', '張九齡', '楊炯', '宋之問', '崔湜', '王勃', '李嶠', '杜審言', '董思恭', '姚崇', '蘇味道', '郭震', '王無競', '崔融', '閻朝隱', '李適', '劉憲', '高正臣', '蘇頲', '蔡孚', '徐彥伯', '駱賓王', '武三思', '喬知之', '劉希夷', '陳子昂', '張說', '張均', '韋嗣立', '李乂', '盧藏用', '吳少微', '沈佺期', '趙冬曦', '張循之', '司馬逸客', '宋務光', '武平一', '趙彥昭', '蕭至忠', '辛替否', '鄭愔', '源幹曜', '李元紘', '李適之', '張諤', '韓休', '賀知章', '裴耀卿', '包融', '李憕', '張子容', '張旭', '孫逖', '崔國輔', '崔珪', '李林甫', '盧象', '盧鴻一', '徐安貞', '王維', '王縉', '崔顥', '祖詠', '李頎', '綦毋潛', '儲光羲', '王昌齡', '常建', '杜頠', '陶翰', '劉長卿', '顏真卿', '李華', '蕭穎士', '崔曙', '王翰', '孟雲卿', '張巡', '孟浩然', '李白', '韋應物', '劉灣', '張謂', '岑參', '沈宇', '杜儼', '楊賁', '包佶', '李嘉佑', '包何', '賈邕', '皇甫曾', '高適', '李棲筠', '杜甫', '賈至', '錢起', '元結', '張繼', '韓翃', '獨孤及', '郎士元', '皇甫冉', '劉方平', '劉太真', '王之渙', '常袞', '蘇源明', '劉昚虛', '柳中庸', '崔惠童', '沈千運', '秦系', '任華', '韓滉', '嚴維', '顧況', '耿湋', '戎昱', '竇叔向', '韋元甫', '戴叔倫', '張建封', '盧綸', '崔琮', '李益', '李端', '暢當', '陸贄', '楊憑', '楊凝', '楊淩', '司空曙', '崔峒', '苗發', '張南史', '王建', '劉商', '陳翊', '朱灣', '丘丹', '張志和', '郭鄖', '於鵠',  '劉長川', '劉迥', '崔元翰', '陳京', '朱放', '武元衡', '李吉甫', '顏粲', '權德輿', '張薦', '段文昌', '羊士諤', '楊巨源', '令狐楚', '裴度', '韓愈', '王涯', '賈棱', '陳羽', '歐陽詹', '柳宗元', '劉禹錫', '張弘靖', '張仲素', '庾承宣', '李翱', '呂溫', '孟郊', '張籍', '盧仝',  '李賀', '劉叉', '元稹', '白居易', '胡杲', '王起', '楊衡', '牛僧孺', '牟融', '劉言史', '長孫佐輔', '盧殷', '雍裕之', '段弘古', '李逢吉', '徐凝', '李德裕', '熊孺登', '李涉', '陸暢', '柳公權', '李紳', '崔公信', '鮑溶', '盧鈞', '舒元輿', '盧宗回', '張蕭遠', '殷堯藩', '沈亞之', '施肩吾', '費冠卿', '姚合', '周賀', '鄭巢', '呂群', '章孝標', '蔣防', '孔溫業', '顧非熊', '張祜', '楊洵美', '裴夷直', '朱慶餘', '王彥威', '楊發', '雍陶', '李遠', '杜牧', '許渾', '李商隱', '紀唐夫', '喻鳧', '劉得仁', '權審', '朱景玄', '薛逢', '趙嘏', '盧肇', '丁棱', '姚鵠', '項斯', '馬戴', '易重', '薛能', '劉威', '裴休', '于興宗', '韓琮', '王傳', '鄭嵎', '李群玉', '賈島', '溫庭筠', '段成式', '劉駕', '劉滄', '李頻', '李郢', '崔玨', '曹鄴', '儲嗣宗', '于武陵', '司馬紮', '徐商', '高駢', '於濆', '牛征', '李昌符', '汪遵', '許棠', '邵謁',     '林寬', '劉鄴', '皮日休', '陸龜蒙', '張賁', '司空圖', '周繇', '顧雲', '張喬', '曹唐', '來鵠', '李山甫', '李鹹用', '胡曾', '方幹', '羅鄴', '羅隱', '羅虯', '鄭損', '高蟾', '章碣', '秦韜玉', '唐彥謙', '周樸', '鄭穀', '許彬', '崔塗', '韓偓', '吳融', '孫偓', '陸希聲', '王駕', '杜荀鶴', '張道古', '韋莊', '王貞白', '張蠙', '翁承贊', '黃滔', '殷文圭', '徐夤', '錢珝', '喻坦之', '崔道融', '盧延讓', '曹松', '蘇拯', '路德延', '裴說', '李洞', '唐求', '於鄴', '陸貞洞', '胡令能', '周曇', '李九齡', '胡宿', '高力士', '李密', '羅紹威', '和凝', '王仁裕', '馮道', '宋齊丘', '李建勳', '孟賓於', '陳貺', '張泌', '孫魴', '伍喬', '陳陶', '李中', '徐鉉', '徐鍇', '孟貫', '成彥雄', '周庠', '徐光溥', '劉昭禹', '楊夔', '譚用之', '王周', '劉兼', '孫元晏', '嚴識玄', '鄭軌', '董初', '宋雍', '趙起', '蕭意', '吉師老', '崔江', '馮道之', '邢象玉', '李季華', '王約', '鄭蕡', '趙鐸', '南溟', '學士', '龍文館士', '無名氏', '聯句', '佚句', '宮人', '花蕊夫人', '楊容華', '柳氏', '郎大家宋氏', '關盼盼', '薛濤', '魚玄機', '李冶', '寒山', '拾得', '慧宣', '靈一', '靈澈', '護國', '清江', '無可', '皎然', '廣宣', '含曦', '子蘭', '可止', '貫休', '齊己', '尚顏', '可朋', '曇翼', '慈恩寺沙門', '司馬承禎', '吳筠', '杜光庭', '鄭遨', '呂岩', '孫思邈', '馬湘', '清遠道士', '張雲容', '洞庭龍君', '慕容垂', '九華山白衣', '原陵老翁', '李淵', '高亭', '甘洽', '李兼', '雜辭', '雜祠', '李瀚', '盧言', '詞']
#print L1
#for x in L1:
#    print "'%s'," %x ,
#print
#sys.exit()

for x in L1:
    if x in L2: #already have this book, skip
        continue
#    print x
    #Generate author.recipe from my3.recipe, replace the belowline with x (one of the author above in str a)
    #author = '杜甫' #//@author_mark
    fw = open('generated_recipe/'+x+'.recipe','w')
    with open('my_sample.recipe') as fr: 
        content = fr.readlines()
        for y in content:
            if 'author =' in y and '''#//@author_mark''' in y:
                y = 'author = "' +x+'"\n'
            fw.write(y)
    fr.close()
    fw.close()

    #cmds to generate mobi and epub files
    cmd = 'ebook-convert generated_recipe/%s.recipe books_fanti/全唐詩_繁體_%s.mobi' %(x,x)
    print cmd
    cmd = 'ebook-convert generated_recipe/%s.recipe books_fanti/全唐詩_繁體_%s.epub' %(x,x)
    print cmd
    #break # debug:w

        
